from diffusers import DiffusionPipeline
import torch, os
from dotenv import load_dotenv
load_dotenv()
print(torch.cuda.is_available()) 
print(torch.cuda.get_device_name(0))  

pipe = DiffusionPipeline.from_pretrained(
    "black-forest-labs/FLUX.1-dev",
    token=os.getenv("HF_TOKEN"),
    torch_dtype=torch.bfloat16
).to("cuda")
image = pipe("""
             كوميكس ملوّن بأسلوب مانغا/أنمي مرح وخفيف. المشهد في شارع قديم ليلًا، إضاءة فوانيس بسيطة.
هارون الرشيد يظهر بملامح وقار مع لمسة استغراب، حاجب مرفوع ونظرة فاحصة. رجل بسيط يحمل زجاجة خمر، ملامحه ذكية وماكرة قليلًا.
الكوميكس مكوّن من ثلاث لوحات واضحة: اللوحة الأولى: هارون الرشيد ينظر إلى الزجاجة ويسأل باستغرب: «ما هذا بيدك؟» اللوحة الثانية:
الرجل يرد بسرعة وبوجه بريء: «هذا لبن». اللوحة الثالثة: هارون الرشيد يقترب قليلًا ويقول متعجبًا: «ومتى أصبح اللبن أحمر يا هذا؟» الرجل يبتسم بثقة ودهاء ويجيب: «احمر خجلًا منك يا أمير المؤمنين» فعجب هارون الرشيد من دهاء الرجل فضحك أمير المؤمنين وعفى عنه.
ألوان دافئة، تعبيرات وجه واضحة ومبالغ فيها قليلًا لإبراز الطرافة، لغة جسد كوميدية، أسلوب كوميكس لطيف، جودة عالية.
             """).images[0]
image.save("out.png")